export const BASE = "/bi/"; // 大数据平台改为 export const BASE = "/dubhe/dubhe/";
// export const BASE = "http://172.16.5.112:7087/bi/";

/*登陆、登出*/
export const LOGIN = {
  IN: `${BASE}sysUser/login`,
  OUT: `${BASE}sysUser/logout`
};
/*图表类型映射*/
export const CHARTTYPE = {
  "1": "circle",
  "2": "bar",
  "3": "areaMap",
  "4": "pointMap",
  "5": "tableBar",
  "6": "wordCloud",
  "7": "bubble",
  "8": "chart",
  "9": "map",
  "10": "bMap",
  "11": "table",
  "12": "d3Bubble",
  "13": "analysisAreaMap",
  "14": "wordcloud",
  "100": "filtersInChart"
};

export const colorThemes = [
  {
    name: "blue",
    colors: [
      "rgba(74,114,201,1)",
      "rgba(66,163,183,1)",
      "rgba(161,203,128,1)",
      "rgba(114,158,144,1)",
      "rgba(66,148,184,1)",
      "rgba(138,160,211,1)",
      "rgba(95,113,198,1)",
      "rgba(163,204,247,1)",
      "rgba(79,223,255,1)",
      "rgba((66,160,247,1)",
      "rgba(90,110,255,1)",
      "rgba(38,224,165,1)",
      "rgba((0,178,218,1)",
      "rgba(40,113,211,1)",
      "rgba(255,207,72,1)"
    ]
  },
  {
    name: "yellow",
    colors: [
      "rgba(255,191,83,1)",
      "rgba(4,177,194,1)",
      "rgba(240,116,116,1)",
      "rgba(197,87,132,1)",
      "rgba(154,95,179,1)",
      "rgba(207,98,215,1)",
      "rgba(94,120,234,1)",
      "rgba(81,179,240,1)",
      "rgba(0,197,200,1)",
      "rgba(88,103,195,1)",
      "rgba(255,82,94,1)",
      "rgba255,169,204,1)",
      "rgba(255,170,0,1)",
      "rgba(255,219,3,1)",
      "rgba(156,204,102,1)"
    ]
  },
  {
    name: "red",
    colors: [
      "rgba(151,67,55,1)",
      "rgba(125,132,255,1)",
      "rgba(225,134,247,1)",
      "rgba(250,80,132,1)",
      "rgba(249,208,35,1)",
      "rgba(242,144,28,1)",
      "rgba(157,94,196,1)",
      "rgba(116,154,247,1)",
      "rgba(58,232,239,1)",
      "rgba(58,208,249,1)",
      "rgba(120,253,132,1)",
      "rgba(6,142,234,1)",
      "rgba((1,189,190,1)",
      "rgba(3,115,161,1)",
      "rgba(248,106,140,1)"
    ]
  },
  {
    name: "purple",
    colors: [
      "rgba(50,57,135,1)",
      "rgba(57,85,185,1)",
      "rgba(95,101,211,1)",
      "rgba(113,79,173,1)",
      "rgba(183,99,177,1)",
      "rgba((238,115,147,1)",
      "rgba(40,46,108,1)",
      "rgba(46,68,148,1)",
      "rgba((124,81,236,1)",
      "rgba(67,67,72,1)",
      "rgba(144,237,125,1)",
      "rgba(247,163,92,1)",
      "rgba(128,133,233,1)",
      "rgba(241,92,128,1)",
      "rgba(228,211,84,1)"
    ]
  },
  {
    name: "green",
    colors: [
      "rgba(188,203,120,1)",
      "rgba(153,143,83,1)",
      "rgba(225,208,159,1)",
      "rgba(227,153,113,1)",
      "rgba(219,84,70,1)",
      "rgba(231,130,80,1)",
      "rgba(219,169,71,1)",
      "rgba(62,173,255,1)",
      "rgba(225,134,247,1)",
      "rgba(249,208,35,1)",
      "rgba(242,144,28,1)",
      "rgba(145,168,255,1)",
      "rgba(144,237,125,1)",
      "rgba(247,163,92)",
      "rgba128,133,233,1)"
    ]
  }
];
